org/CSS.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>CSS</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-01-07 21:53:59 CST"/>
<meta name="author" content="Jalen Wang"/>
</head><body>
<h1 class="title">CSS</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">1 数据和视图分离 </h2>
<div id="text-1">

<ul>
<li id="sec-1.1">有了 CSS,就可以控制页面的外观并且将文档的表现部分与内容分隔开 <br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">2 更易于保持各个界面的风格的一致性 </h2>
<div id="text-2">

<ul>
<li id="sec-2.1">这个界面可以使用相同的CSS <br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">3 标记 </h2>
<div id="text-3">

<ul>
<li id="sec-3.1">id 和 类名 <br/>
</li>
<li id="sec-3.2">div 和 span <br/>
div 可以用来对块级元素进行分组,而 span 可以用来对行内元素进行分组或标识
</li>
</ul>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">4 为样式找到目标 </h2>
<div id="text-4">

<p>有效且结构良好的文档为应用样式提供了一个框架。要想使用 CSS 将样式应用于特定的(X)HTML 元素,
需要有办法找到这个元素。在 CSS 中,执行这一任务的样式规则部分称为选择器(selector)。
</p><ul>
<li id="sec-4.1">常用的选择器 <br/>
<ul>
<li id="sec-4.1.1">类型选择器 <br/>
类型选择器有时候也称为元素选择器或简单选择器



<pre class="src src-css">
<span style="color: #0000ff;">p </span>{ <span style="color: #b8860b;">color</span>: black;}
<span style="color: #0000ff;">a </span>{ <span style="color: #b8860b;">text-decoration</span>: underline;}
<span style="color: #0000ff;">h1 </span>{ <span style="color: #b8860b;">fon-weight</span>: bold;}
</pre>



</li>
<li id="sec-4.1.2">后代选择器可用来寻找特定元素或元素组的后代 <br/>
后代选择器由其他两个选择器之间的空格表示。在下面的示例中,只在作为列表项的后
代的锚元素上应用样式,而段落中的锚不受影响。



<pre class="src src-css">
<span style="color: #0000ff;">li a </span>{ <span style="color: #b8860b;">text-decoration</span>: none;}
</pre>



</li>
<li id="sec-4.1.3">ID 选择器由一个#字符表示,类选择器由一个点号表示 <br/>



<pre class="src src-css">
<span style="color: #0000ff;">#intro </span>{ <span style="color: #b8860b;">font-weight</span>: bold;}
<span style="color: #0000ff;">.dateposted </span>{ <span style="color: #b8860b;">color</span>: green;}
&lt;p id=<span style="color: #bc8f8f;">"intro"</span>&gt;some text&lt;/p&gt;
&lt;p class=<span style="color: #bc8f8f;">"dateposted"</span>&gt;24/3/2006&lt;/p&gt;
</pre>



</li>
</ul>
</li>
<li id="sec-4.2">伪类 <br/>



<pre class="src src-css">
<span style="color: #b22222;">/*</span><span style="color: #b22222;">maks all unvisited links blue</span><span style="color: #b22222;">*/</span>
<span style="color: #b8860b;">a</span>: like{ <span style="color: #b8860b;">color</span>: blue;}
<span style="color: #b22222;">/*</span><span style="color: #b22222;">makes all visited links green</span><span style="color: #b22222;">*/</span>
<span style="color: #b8860b;">a</span>: visited { <span style="color: #b8860b;">color</span>: green;}
<span style="color: #b22222;">/*</span><span style="color: #b22222;">maks links red when hovered or activated</span><span style="color: #b22222;">*/</span>
<span style="color: #b8860b;">a</span>: hover, a: active{ <span style="color: #b8860b;">color</span>: red;}
<span style="color: #b22222;">/*</span><span style="color: #b22222;">maks table rows red when hovered over</span><span style="color: #b22222;">*/</span>
<span style="color: #b8860b;">tr</span>: hover { <span style="color: #b8860b;">background-color</span>: red;}
<span style="color: #b22222;">/*</span><span style="color: #b22222;">maks input elements yellow when focus is applied</span><span style="color: #b22222;">*/</span>
<span style="color: #b8860b;">input</span>: focus{ <span style="color: #b8860b;">background-color</span>: yellow;}
</pre>



<p>
:link 和:visited 称为链接伪类,只能应用于锚元素。:hover、:active 和:focus 称为动态伪类,理论
上可以应用于任何元素。不幸的是,只有少数现代浏览器(比如 Firefox)支持这种功能。IE 6 和更低版本
只注意应用于锚链接的:active 和:hover 选择器,完全忽略: focus。
</p></li>
<li id="sec-4.3">通用选择器 <br/>



<pre class="src src-css">
*{ <span style="color: #b8860b;">padding</span>: 0; <span style="color: #b8860b;">margin</span>: 0; }
</pre>





</li>
</ul>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">5 Question </h2>
<div id="text-5">

<ul>
<li id="sec-5.1">strong em <br/>
</li>
<li id="sec-5.2">blockquote cite <br/>
</li>
<li id="sec-5.3">abbr acronym code <br/>
</li>
<li id="sec-5.4">fieldset legend label <br/>
</li>
<li id="sec-5.5">caption thead tbody tfoot <br/>
</li>
</ul>
</div>
</div>
<div id="postamble"><p class="author"> Author: Jalen Wang
<a href="mailto:jiayuewang228@gmail.com">&lt;jiayuewang228@gmail.com&gt;</a>
</p>
<p class="date"> Date: 2012-01-07 21:53:59 CST</p>
<p>HTML generated by org-mode 6.21b in emacs 23</p>
</div></body>
</html>
